<!doctype html>
<html>
	<head>
		<meta charset="utf-8">
		<meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no">

		<title>Escuela de Código - San Andrés Tetepilco</title>

		<link rel="stylesheet" href="dist/reset.css">
		<link rel="stylesheet" href="dist/reveal.css">
		<link rel="stylesheet" href="dist/theme/white.css">
		

		<!-- Theme used for syntax highlighted code -->
		<link rel="stylesheet" href="plugin/highlight/monokai.css" id="highlight-theme">
		<link rel="stylesheet" href="css/sesion1.css">
	</head>
	<body>
		<div class="reveal">
			<div class="slides">
				<section>
					<img src="img/logoPilares.png" />
					<p>San Andrés Tetepilco</p>
					<h2 class="edcodigo">Escuela de código</h2>
					
					<p>Metodolog&iacute;as &aacute;giles </p>
				</section>
				<section>
                    <p><b>¿Qu&eacute; son las metodolog&iacute;as &aacute;giles?</b></p>
                    <p>Son un conjunto de tareas y procedimientos relacionados con la gesti&oacute;n de proyectos.</p>
                    <p>Nacieron de la necesidad de afrontar cambios constantes en los negocios y la tecnolog&iacute;a. 
                        Para poder adaptar requisitos y soluciones que evolucionan para adaptarse. 
                    </p>
                </section>
                <section>
                    <p><b>Caracter&iacute;sticas:</b></p>
                    <ul >
                        <li>
                           Desarrollo evolutivo y flexible.
                        </li>
                        <li>
                            Autonom&iacute;a de los equipos
                        </li>
                        <li>
                            Planificaci&oacute;n
                        </li>
                        <li>Comunicaci&oacute;n</li>
                    </ul>
                    <img src="img/agile/metod-agile.jpg"/>   
                </section>
                <section>
                    <p><b>¿Qu&eacute; tipo de proyectos pueden manejarse con metodolog&iacute;as &aacute;giles?</b></p>
                    <ul>
                        <li>
                            Proyectos donde el cliente no tiene claros todos los requerimientos
                        </li>
                        <li>
                            Proyectos donde el alcance o el presupuesto pueden cambiar
                        </li>
                        <li>Pr&aacute;cticamente cualquier proyecto que tenga que lidiar con alg&uacute;n tipo de incertidumbre</li>
                    </ul>
                </section>
                <section>
                    <p><b>4 valores</b></p>
                    <img src="img/agile/valores_agile.png" />
                </section>
                <section>
                    <p><b>eXtreme Programming</b></p>
                    <p>Se basa en buenas pr&aacute;cticas de desarrollo de software y se para minimizar posibilidades de error. 
                        Enfocada en retroalimentaci&oacute;n continua entre el equipo de desarrollo y el cliente.
                    </p>
                    <p>Proyectos con condiciones muy variables o ambiguas, con entregas muy r&aacute;pidas. </p>

                </section>
                <section>
                    <img src="img/agile/xp.webp" />
                </section>
                <section>
                    <p><b>Caracter&iacute;sticas:</b></p>
                    <ul>
                        <li>Versiones parciales</li>
                        <li>Diseño simple</li>
                        <li>Ritmo de trabajo constante</li>
                        <li>Integraci&oacute;n continua</li>
                        <li>C&oacute;digo claro y simple </li>
                    </ul>
                    <p>Requiere de programadores con experiencia.</p>
                </section>
                <section>
                    <p><b>Kanban</b></p>
                    <p>Significa Tarjeta Visual. Se controla el avance del trabajo como en una l&iacute;nea de producci&oacute;n.
                        Cada tarea tiene un estatus y se utiliza un tablero para representar el flujo de trabajo.
                        </p>
                    <p>  Su objetivo es mejorar la eficiencia del equipo y por eso el flujo de trabajo 
                        tiene que estar siempre visible. </p>
                </section>
                <section>
                    <img src="img/agile/kanban.webp" />
                </section>
                <section>
                    <p>Permite observar de forma clara qu&eacute; se est&aacute; haciendo.</p>
                    <p>Se pueden poner muchas columnas, hay una lectura f&aacute;cil de los indicadores y se puede realizar
                         un seguimiento en el tiempo.</p>
                    <p> Es importante limitar la cantidad de trabajo en proceso, evitar no terminar tareas.</p>
                </section>
                <section>
                    <p><b>Scrum</b></p>
                    <p>Es un marco de trabajo donde el producto se libera de forma peri&oacute;dica, de forma iterativa e 
                        incremental, aplica buenas pr&aacute;cticas en el trabajo colaborativo. 
                    </p>
                    <p>Se realizan entregas regulares y parciales llamadas Sprint, que tienen prioridad establecida previamente
                        seg&uacute;n el beneficio que aporten al cliente. Indicado para proyectos en entornos complejos. </p>
                </section>
                <section>
                    <p><b>El equipo Scrum</b></p>
                    <img src="img/agile/scrum.webp" />
                </section>
                <section>
                    <p><b>Reuniones</b></p>
                    <ul>
                        <li>Planificaci&oacute;n: Al inicio de cada sprint, para planificar la cantidad de trabajo que el 
                            equipo se va a comprometer a construir.
                        </li>
                        <li>Diaria: M&aacute;ximo 15 minutos. Qu&eacute; se hizo ayer, qu&eacute; se har&aacute; hoy y qu&eacute;
                            problemas han surgido. </li>
                        <li>Revisi&oacute;n: Se exponen los puntos completados y los que no.</li>
                        <li>Retrospectiva: Al final del sprint, el equipo reflexiona y obtiene posibles acciones de 
                            mejora.  </li>

                    </ul>
                </section>
                <section>
                    <p><b>Ventajas</b></p>
                    <img src="img/agile/ventajas.png" width="50%"/>
                </section>
                <section>
                    <p><b>Ventajas</b></p>
                    <ul>
                        <li>
                            Flexibilidad en los procesos
                        </li>
                        <li>
                            Retroalimentaci&oacute;n constante del cliente
                        </li>
                        <li>
                            Transparencia
                        </li>
                        <li>Interacciones entre el equipo y con el cliente</li>
                    </ul>
                </section>
			</div>
		</div>

		<script src="dist/reveal.js"></script>
		<script src="plugin/notes/notes.js"></script>
		<script src="plugin/markdown/markdown.js"></script>
		<script src="plugin/highlight/highlight.js"></script>
		<script>
			// More info about initialization & config:
			// - https://revealjs.com/initialization/
			// - https://revealjs.com/config/
			Reveal.initialize({
				hash: true,

				// Learn about plugins: https://revealjs.com/plugins/
				plugins: [ RevealMarkdown, RevealHighlight, RevealNotes ]
			});
		</script>
	</body>
</html>
